Tutorials/kOmega/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2.0;

boundaryField
{
    top
    {
        type            slip;
    }

    bottom
    {
	    type		    zeroGradient;
    }
    

    atmosphere
    {
         type            inletOutlet;
	inletValue uniform 2.0;
	value uniform 2.0;
    }

    frontBack
    {
        type            empty;
    }
    
    inlet_half0
    {
	    type		    cyclic;
    }
    
 
    inlet_half1
    {
	    type		    cyclic;
    }
}

// ************************************************************************* //
